In [59]:
import MySQLdb as mdb
import pandas as pd
import yaml

from pprint import pprint

In [60]:
# Initialise mysql connection from own config file
# Example config file is given in config_example.yaml
with open('config.yaml', 'r') as f:
    config = yaml.load(f)


# Define connection
con = mdb.connect(config['hostname'], 
                  config['username'], 
                  config['password'], 
                  config['database']
                  )

In [61]:
with con:
    
    cur = con.cursor()
    sql = "SELECT COUNT(*) FROM supplement411"
    cur.execute(sql)
    rows = cur.fetchone()
    print "Number of rows:",rows[0]

Number of rows: 224

In [62]:
with con:
    
    cur = con.cursor()
    sql = """SELECT YEAR(updated) AS update_year, COUNT(DISTINCT id) as num_products
            FROM supplement411
            GROUP BY update_year"""
    cur.execute(sql)
    rows = cur.fetchall()
    
    print type(rows)
    print rows

<type 'tuple'>
((None, 12L), (2013L, 4L), (2014L, 87L), (2015L, 79L), (2016L, 42L))

In [63]:
# Count number of entries in the list by year
df = None
with con:
    
    cur = con.cursor()
    sql = """SELECT YEAR(updated) AS update_year, COUNT(DISTINCT id) as num_products
            FROM supplement411
            GROUP BY update_year"""
    cur.execute(sql)
    rows = cur.fetchall()
    
    row_list = [list(x) for x in rows]
    df = pd.DataFrame(row_list)

df

      0   1
0   nan  12
1 2,013   4
2 2,014  87
3 2,015  79
4 2,016  42

In [64]:
# Count number of entries in the list by month/year
df = None
with con:
    
    cur = con.cursor()
#     sql = """SELECT YEAR(updated) AS update_year, MONTH(updated) AS update_month, COUNT(DISTINCT id)
    sql = """SELECT YEAR(updated) AS update_year, MONTHNAME(updated) AS update_month, COUNT(DISTINCT id)
            FROM supplement411
            GROUP BY update_year, update_month"""
    cur.execute(sql)
    rows = cur.fetchall()
    print rows

    row_list = [list(x) for x in rows]
    df = pd.DataFrame(row_list)
    df.columns = ['Year', 'Month', 'Number of entries']

df

((None, None, 12L), (2013L, 'August', 1L), (2013L, 'December', 3L), (2014L, 'April', 13L), (2014L, 'January', 13L), (2014L, 'July', 4L), (2014L, 'March', 21L), (2014L, 'May', 10L), (2014L, 'November', 7L), (2014L, 'October', 19L), (2015L, 'April', 11L), (2015L, 'December', 23L), (2015L, 'February', 1L), (2015L, 'January', 4L), (2015L, 'July', 7L), (2015L, 'June', 10L), (2015L, 'May', 12L), (2015L, 'October', 1L), (2015L, 'September', 10L), (2016L, 'April', 2L), (2016L, 'February', 16L), (2016L, 'March', 4L), (2016L, 'May', 20L))

    Year      Month  Number of entries
0    nan       None                 12
1  2,013     August                  1
2  2,013   December                  3
3  2,014      April                 13
4  2,014    January                 13
5  2,014       July                  4
6  2,014      March                 21
7  2,014        May                 10
8  2,014   November                  7
9  2,014    October                 19
10 2,015      April                 11
11 2,015   December                 23
12 2,015   February                  1
13 2,015    January                  4
14 2,015       July                  7
15 2,015       June                 10
16 2,015        May                 12
17 2,015    October                  1
18 2,015  September                 10
19 2,016      April                  2
20 2,016   February                 16
21 2,016      March                  4
22 2,016        May                 20